; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=76, out_folder=htg/blocksworld/training, instance_id=56, seed=2080, goal_proportion=0.1

(define (problem blocksworld-56)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 - object)
 (:init 
    (arm-empty)
    (clear b69)
    (on b69 b7)
    (on b7 b33)
    (on b33 b51)
    (on b51 b75)
    (on b75 b55)
    (on b55 b34)
    (on b34 b16)
    (on b16 b32)
    (on b32 b10)
    (on b10 b70)
    (on b70 b4)
    (on-table b4)
    (clear b61)
    (on b61 b45)
    (on b45 b43)
    (on b43 b47)
    (on b47 b49)
    (on b49 b66)
    (on b66 b67)
    (on b67 b40)
    (on b40 b57)
    (on b57 b68)
    (on b68 b64)
    (on b64 b73)
    (on b73 b23)
    (on b23 b44)
    (on b44 b25)
    (on b25 b3)
    (on-table b3)
    (clear b26)
    (on b26 b76)
    (on b76 b58)
    (on b58 b20)
    (on b20 b28)
    (on-table b28)
    (clear b72)
    (on b72 b11)
    (on b11 b31)
    (on b31 b74)
    (on b74 b15)
    (on-table b15)
    (clear b8)
    (on b8 b48)
    (on b48 b59)
    (on b59 b39)
    (on b39 b36)
    (on b36 b29)
    (on-table b29)
    (clear b2)
    (on-table b2)
    (clear b71)
    (on b71 b5)
    (on b5 b19)
    (on b19 b14)
    (on-table b14)
    (clear b50)
    (on b50 b1)
    (on b1 b42)
    (on b42 b24)
    (on b24 b63)
    (on b63 b12)
    (on b12 b9)
    (on-table b9)
    (clear b17)
    (on b17 b46)
    (on b46 b21)
    (on b21 b35)
    (on b35 b37)
    (on b37 b13)
    (on b13 b65)
    (on b65 b53)
    (on b53 b27)
    (on b27 b38)
    (on b38 b18)
    (on b18 b30)
    (on b30 b60)
    (on b60 b56)
    (on-table b56)
    (clear b22)
    (on b22 b41)
    (on b41 b62)
    (on b62 b54)
    (on b54 b52)
    (on b52 b6)
    (on-table b6))
 (:goal  (and 
    (clear b3)
    (on b3 b2)
    (on b2 b5)
    (on b5 b7)
    (on b7 b6)
    (on b6 b4)
    (on b4 b1)
    (on-table b1))))

; plan
1. (unstack b71 b5)
   deleted: (on b71 b5) (clear b71) (arm-empty)
   added: (holding b71) (clear b5)
   goals met: 0 of 8
2. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 0 of 8
3. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 0 of 8
4. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 1 of 8
5. (unstack b50 b1)
   deleted: (on b50 b1) (clear b50) (arm-empty)
   added: (holding b50) (clear b1)
   goals met: 1 of 8
6. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 1 of 8
7. (unstack b1 b42)
   deleted: (on b1 b42) (clear b1) (arm-empty)
   added: (holding b1) (clear b42)
   goals met: 1 of 8
8. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 2 of 8
9. (unstack b69 b7)
   deleted: (on b69 b7) (clear b69) (arm-empty)
   added: (holding b69) (clear b7)
   goals met: 2 of 8
10. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 2 of 8
11. (unstack b22 b41)
   deleted: (on b22 b41) (clear b22) (arm-empty)
   added: (holding b22) (clear b41)
   goals met: 2 of 8
12. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 8
13. (unstack b61 b45)
   deleted: (on b61 b45) (clear b61) (arm-empty)
   added: (holding b61) (clear b45)
   goals met: 2 of 8
14. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 2 of 8
15. (unstack b45 b43)
   deleted: (on b45 b43) (clear b45) (arm-empty)
   added: (holding b45) (clear b43)
   goals met: 2 of 8
16. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 2 of 8
17. (unstack b43 b47)
   deleted: (on b43 b47) (clear b43) (arm-empty)
   added: (holding b43) (clear b47)
   goals met: 2 of 8
18. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 2 of 8
19. (unstack b47 b49)
   deleted: (on b47 b49) (clear b47) (arm-empty)
   added: (holding b47) (clear b49)
   goals met: 2 of 8
20. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 2 of 8
21. (unstack b49 b66)
   deleted: (on b49 b66) (clear b49) (arm-empty)
   added: (holding b49) (clear b66)
   goals met: 2 of 8
22. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 2 of 8
23. (unstack b66 b67)
   deleted: (on b66 b67) (clear b66) (arm-empty)
   added: (holding b66) (clear b67)
   goals met: 2 of 8
24. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 2 of 8
25. (unstack b67 b40)
   deleted: (on b67 b40) (clear b67) (arm-empty)
   added: (holding b67) (clear b40)
   goals met: 2 of 8
26. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 2 of 8
27. (unstack b40 b57)
   deleted: (on b40 b57) (clear b40) (arm-empty)
   added: (holding b40) (clear b57)
   goals met: 2 of 8
28. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 2 of 8
29. (unstack b57 b68)
   deleted: (on b57 b68) (clear b57) (arm-empty)
   added: (holding b57) (clear b68)
   goals met: 2 of 8
30. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 2 of 8
31. (unstack b68 b64)
   deleted: (on b68 b64) (clear b68) (arm-empty)
   added: (holding b68) (clear b64)
   goals met: 2 of 8
32. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 2 of 8
33. (unstack b41 b62)
   deleted: (on b41 b62) (clear b41) (arm-empty)
   added: (holding b41) (clear b62)
   goals met: 2 of 8
34. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 2 of 8
35. (unstack b62 b54)
   deleted: (on b62 b54) (clear b62) (arm-empty)
   added: (holding b62) (clear b54)
   goals met: 2 of 8
36. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 2 of 8
37. (unstack b64 b73)
   deleted: (on b64 b73) (clear b64) (arm-empty)
   added: (holding b64) (clear b73)
   goals met: 2 of 8
38. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 2 of 8
39. (unstack b73 b23)
   deleted: (on b73 b23) (clear b73) (arm-empty)
   added: (holding b73) (clear b23)
   goals met: 2 of 8
40. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 2 of 8
41. (unstack b23 b44)
   deleted: (on b23 b44) (clear b23) (arm-empty)
   added: (holding b23) (clear b44)
   goals met: 2 of 8
42. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 8
43. (unstack b44 b25)
   deleted: (on b44 b25) (clear b44) (arm-empty)
   added: (holding b44) (clear b25)
   goals met: 2 of 8
44. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 2 of 8
45. (unstack b25 b3)
   deleted: (on b25 b3) (clear b25) (arm-empty)
   added: (holding b25) (clear b3)
   goals met: 3 of 8
46. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 3 of 8
47. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 8
48. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 4 of 8
49. (unstack b54 b52)
   deleted: (on b54 b52) (clear b54) (arm-empty)
   added: (holding b54) (clear b52)
   goals met: 4 of 8
50. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 4 of 8
51. (unstack b52 b6)
   deleted: (on b52 b6) (clear b52) (arm-empty)
   added: (holding b52) (clear b6)
   goals met: 4 of 8
52. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 8
53. (unstack b7 b33)
   deleted: (on b7 b33) (clear b7) (arm-empty)
   added: (holding b7) (clear b33)
   goals met: 4 of 8
54. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 5 of 8
55. (unstack b33 b51)
   deleted: (on b33 b51) (clear b33) (arm-empty)
   added: (holding b33) (clear b51)
   goals met: 5 of 8
56. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 8
57. (unstack b51 b75)
   deleted: (on b51 b75) (clear b51) (arm-empty)
   added: (holding b51) (clear b75)
   goals met: 5 of 8
58. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 5 of 8
59. (unstack b75 b55)
   deleted: (on b75 b55) (clear b75) (arm-empty)
   added: (holding b75) (clear b55)
   goals met: 5 of 8
60. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 5 of 8
61. (unstack b55 b34)
   deleted: (on b55 b34) (clear b55) (arm-empty)
   added: (holding b55) (clear b34)
   goals met: 5 of 8
62. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 8
63. (unstack b34 b16)
   deleted: (on b34 b16) (clear b34) (arm-empty)
   added: (holding b34) (clear b16)
   goals met: 5 of 8
64. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 5 of 8
65. (unstack b16 b32)
   deleted: (on b16 b32) (clear b16) (arm-empty)
   added: (holding b16) (clear b32)
   goals met: 5 of 8
66. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 8
67. (unstack b32 b10)
   deleted: (on b32 b10) (clear b32) (arm-empty)
   added: (holding b32) (clear b10)
   goals met: 5 of 8
68. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 5 of 8
69. (unstack b10 b70)
   deleted: (on b10 b70) (clear b10) (arm-empty)
   added: (holding b10) (clear b70)
   goals met: 5 of 8
70. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 5 of 8
71. (unstack b70 b4)
   deleted: (on b70 b4) (clear b70) (arm-empty)
   added: (holding b70) (clear b4)
   goals met: 5 of 8
72. (putdown b70)
   deleted: (holding b70)
   added: (clear b70) (arm-empty) (on-table b70)
   goals met: 5 of 8
73. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 8
74. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 6 of 8
75. (unstack b7 b6)
   deleted: (on b7 b6) (clear b7) (arm-empty)
   added: (holding b7) (clear b6)
   goals met: 5 of 8
76. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 5 of 8
77. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 5 of 8
78. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 6 of 8
79. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 8
80. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 7 of 8
81. (unstack b3 b2)
   deleted: (on b3 b2) (clear b3) (arm-empty)
   added: (holding b3) (clear b2)
   goals met: 5 of 8
82. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 8
83. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 5 of 8
84. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 8
85. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 5 of 8
86. (stack b5 b7)
   deleted: (clear b7) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b7)
   goals met: 6 of 8
87. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 6 of 8
88. (stack b2 b5)
   deleted: (clear b5) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b5)
   goals met: 7 of 8
89. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 8
90. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 8 of 8
